# Pandas Exercise 01 - Getting and Knowing your Data - Solution

In [3]:
# THIS CODE PREPARES YOU FOR THE EXERCISE
# RUN IT BEFORE YOU START WORKING
import pandas as pd

Pandas Exercise is a series of challenges designed to help you ge familiar with the pandas tool. After finishing these exercises, you will feel conforatble working with pandas to explore any dataset you come across. 

It is advised to read the [pandas tutorial]() before you start. Save your work on gist for future reference. When you are stuck, instead of referencing the solution, go to the documentation and stackoverflow. In this way, you will learn faster and better.

In this exercise, we will pull data directly from the internet, and then explore it.

### Challenge 1. Read and Explore the Data 
- Use pandas to access the data: https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv
- Show its first 10 entries, columns names, index names and shape

In [4]:
df = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv", sep='\t')

In [8]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [7]:
df.shape

(4622, 5)

In [10]:
df.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [11]:
df.index

RangeIndex(start=0, stop=4622, step=1)

### Challenge 2.  How many items are carried by the restaurant? Which was the most ordered item? How many?
I'm expecting a number, a string and a number, not dataframe.

In [37]:
df["item_name"].value_counts().count()

50

In [20]:
df.groupby("item_name").sum().sort_values(["quantity"]).tail(1).index.values[0]

'Chicken Bowl'

In [26]:
df.groupby("item_name").sum().sort_values(["quantity"]).tail(1)["quantity"].values[0]

761

### Challenge 3. Calculate revenue for each order, total revenue for the period and average revenue/order.

In [27]:
df["price"] = df["item_price"].apply(lambda x: float(x[1:-1]))
df["revenue"] = df["quantity"] * df["price"]

In [28]:
df.head()

,order_id,quantity,item_name,choice_description,item_price,price,revenue
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,2.39,2.39
1,1,1,Izze,[Clementine],$3.39,3.39,3.39
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,16.98,33.96

In [32]:
df.groupby("order_id")[["revenue"]].sum().head()

          revenue
order_id
1           11.56
2           33.96
3           12.67
4           21.00
5           13.70

In [33]:
df.groupby("order_id")[["revenue"]].sum().sum()

revenue    39237.02
dtype: float64

In [34]:
df.groupby("order_id")[["revenue"]].sum().mean()

revenue    21.394231
dtype: float64

References:

https://github.com/justmarkham